RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_caam.c
    *config = userConfig;
}

/*!
 * brief Initializes the CAAM driver.
 *
 * This function initializes the CAAM driver, including CAAM's internal RNG.
 * param base CAAM peripheral base address
 * param config Pointer to configuration structure.
 * return kStatus_Success the CAAM Init has completed with zero termination status word
 * return kStatus_Fail the CAAM Init has completed with non-zero termination status word
 */
status_t CAAM_Init(CAAM_Type *base, const caam_config_t *config)
{
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    CLOCK_EnableClock(kCLOCK_Caam);
#endif
    status_t status = kStatus_Fail;

    base->MCFGR = 0x80000000u; /* reset */
    base->MCFGR = 0x90000000u; /* reset DMA */
    base->MCFGR = 0x00082300u; /* (reset value) */

    /* job ring interface 0 is mandatory */
    assert(config->jobRingInterface[0]);
    if (NULL == config->jobRingInterface[0])
    {
        return kStatus_Fail; /* return if user wishes to use the job ring but does not configure it. */
    }

    /* Job Rings Configuration
     * number of entries in both input and output ring is equal.
     * Note the size of an entry is different. an entry in the input ring is a 32-bit word.
     * an entry in the output ring is two 32-bit words. (descriptor pointer followed by termination status word)
     */
    s_jr0 = config->jobRingInterface[0];
    (void)memset(s_jr0, 0, sizeof(*s_jr0));
    s_jrIndex0 = 0;
    caam_job_ring_set_base_address_and_size(base, kCAAM_JobRing0, s_jr0->inputJobRing, ARRAY_SIZE(s_jr0->inputJobRing),
                                            s_jr0->outputJobRing, ARRAY_SIZE(s_jr0->outputJobRing) / 2U);

    if (config->jobRingInterface[1] != NULL)
    {
        s_jr1 = config->jobRingInterface[1];
        (void)memset(s_jr1, 0, sizeof(*s_jr1));
        s_jrIndex1 = 0;
        caam_job_ring_set_base_address_and_size(base, kCAAM_JobRing1, s_jr1->inputJobRing,
                                                ARRAY_SIZE(s_jr1->inputJobRing), s_jr1->outputJobRing,
                                                ARRAY_SIZE(s_jr1->outputJobRing) / 2U);
    }

    if (config->jobRingInterface[2] != NULL)
    {
        s_jr2 = config->jobRingInterface[2];
        (void)memset(s_jr2, 0, sizeof(*s_jr2));
        s_jrIndex2 = 0;
        caam_job_ring_set_base_address_and_size(base, kCAAM_JobRing2, s_jr2->inputJobRing,
                                                ARRAY_SIZE(s_jr2->inputJobRing), s_jr2->outputJobRing,
                                                ARRAY_SIZE(s_jr2->outputJobRing) / 2U);
    }

    if (config->jobRingInterface[3] != NULL)
    {
        s_jr3 = config->jobRingInterface[3];
        (void)memset(s_jr3, 0, sizeof(*s_jr3));
        s_jrIndex3 = 0;
        caam_job_ring_set_base_address_and_size(base, kCAAM_JobRing3, s_jr3->inputJobRing,
                                                ARRAY_SIZE(s_jr3->inputJobRing), s_jr3->outputJobRing,
                                                ARRAY_SIZE(s_jr3->outputJobRing) / 2U);
    }

    /*
     * Instantiate RNG in normal (non-deterministic) mode and load the JDKEK, TDKEK and TDSK registers
     * this step is required for example
     * for FIFO STORE command to be able to store Key register as Black key
     * for example during AES XCBC-MAC context switch (need to store derived key K1 to memory)
     */
    caam_rng_config_t rngConfig;
    (void)CAAM_RNG_GetDefaultConfig(&rngConfig);

    /* reset RNG */
    base->RTMCTL = CAAM_RTMCTL_PRGM_MASK | CAAM_RTMCTL_ERR_MASK | CAAM_RTMCTL_RST_DEF_MASK |
                   CAAM_RTMCTL_SAMP_MODE(kCAAM_RNG_SampleModeRaw);
    base->RTMCTL = CAAM_RTMCTL_ERR_MASK | CAAM_RTMCTL_SAMP_MODE(config->rngSampleMode) |
                   CAAM_RTMCTL_OSC_DIV(config->rngRingOscDiv);

    caam_handle_t handle;
    handle.jobRing = kCAAM_JobRing0;

    /* Check if Instantiated State Handle 0 or 1 has been instantiated */
    if ((base->RDSTA & (CAAM_RDSTA_IF0_MASK | CAAM_RDSTA_IF1_MASK)) == 0U)
    {
        status = CAAM_RNG_Init(base, &handle, kCAAM_RngStateHandle0, &rngConfig);
        if (status != kStatus_Success)
        {
            return status;
        }
    }
    else
    {
        status = kStatus_Success;
    }

    /* Check if JDKEK, TDKEK and TDSK are already generated, generate if not */
    /* Note: second secure keys generate per one PoR will generate Secure Key error */
    if ((base->JDKEKR[0U] == 0U) && (base->TDKEKR[0U] == 0U) && (base->TDSKR[0U] == 0U))
    {
        /* Note: Secure key is cleared only during POR reset */
        status = CAAM_RNG_GenerateSecureKey(base, &handle, NULL);
        if (status != kStatus_Success)
        {
            return status;
        }
    }
    else
    {
        status = kStatus_Success;
    }

    /* set RANDDPAR bit for the AESA to reseed its DPA mask using data from kCAAM_RngStateHandle0 */
    /* also set other bits to 1 for security */
    base->SCFGR =
#if defined(FSL_FEATURE_CAAM_HAS_RANDDPAR) && (FSL_FEATURE_CAAM_HAS_RANDDPAR > 0)
        CAAM_SCFGR_RANDDPAR(config->scfgrRandomDpaResistance) |
#endif /* FSL_FEATURE_CAAM_HAS_RANDDPAR */
#if defined(FSL_FEATURE_CAAM_HAS_RDB) && (FSL_FEATURE_CAAM_HAS_RDB > 0)
        CAAM_SCFGR_RDB(config->scfgrEnableRandomDataBuffer) |
#endif /* FSL_FEATURE_CAAM_HAS_RDB */
        CAAM_SCFGR_LCK_TRNG(config->scfgrLockTrngProgramMode) | CAAM_SCFGR_RNGSH0(config->scfgrRandomRngStateHandle0) |
        CAAM_SCFGR_PRIBLOB(config->scfgrPriblob);

    return status;
}

/*!
 * brief Wait for a CAAM job to complete.
 *
 * This function polls CAAM output ring for a specific job.
 *
 * The CAAM job ring is specified by the jobRing field in the caam_handle_t structure.
 * The job to be waited is specified by it's descriptor address.
 *
 * This function has two modes, determined by the mode argument.
 * In blocking mode, the function polls the specified jobRing until the descriptor
 * is available in the CAAM output job ring.
 * In non-blocking mode, it polls the output ring once and returns status
 * immediately.
 *
 * The function can be called from multiple threads or interrupt service routines,
 * as internally it uses global critical section (global interrupt disable enable)
 * to protect it's operation against concurrent accesses.
 * The global interrupt is disabled only when the descriptor is found
 * in the output ring, for a very short time, to remove the descriptor from the output ring
 * safely.
 *
 * param base CAAM peripheral base address
 * param handle Data structure with CAAM jobRing used for this request
 * param descriptor
 * param mode Blocking and non-blocking mode. Zero is blocking. Non-zero is non-blocking.
 * return kStatus_Success the CAAM job has completed with zero job termination status word
 * return kStatus_Fail the CAAM job has completed with non-zero job termination status word
 * return kStatus_Again In non-blocking mode, the job is not ready in the CAAM Output Ring
 */
status_t CAAM_Wait(CAAM_Type *base, caam_handle_t *handle, uint32_t *descriptor, caam_wait_mode_t mode)
{
    /* poll output ring for the specified job descriptor */
    status_t status;
    bool wait;
    bool found;

    wait   = true;
    status = kStatus_Success;
    found  = false;

    while (wait)
    {
        /* any result available on this job ring? */
        if ((caam_output_ring_get_slots_full(base, handle->jobRing)) != 0U)
        {
            status = caam_out_job_ring_test_and_remove(base, handle->jobRing,
                                                       (uint32_t *)ADD_OFFSET((uint32_t)descriptor), &wait, &found);
        }

        /* non-blocking mode polls output ring once */
        if (mode == kCAAM_Nonblocking)
        {
            wait = false; /* exit the while() */
            if (!found)
            {
                status = kStatus_CAAM_Again; /* job not in the tested ring */
            }
        }
    }
    return status;
}

/*!
 * brief Deinitializes the CAAM driver.
 * This function deinitializes the CAAM driver.
 * param base CAAM peripheral base address
 * return kStatus_Success the CAAM Deinit has completed with zero termination status word
 * return kStatus_Fail the CAAM Deinit has completed with non-zero termination status word
 */
status_t CAAM_Deinit(CAAM_Type *base)
{
    caam_handle_t handle;
    handle.jobRing  = kCAAM_JobRing0;
    status_t status = kStatus_Fail;
    status          = CAAM_RNG_Deinit(base, &handle, kCAAM_RngStateHandle0);
    if (status != kStatus_Success)
    {
        return status;
    }

    base->JOBRING[0].JRCR_JR = CAAM_JRCR_JR_RESET_MASK;
    base->JOBRING[0].JRCR_JR = CAAM_JRCR_JR_RESET_MASK;
    base->JOBRING[1].JRCR_JR = CAAM_JRCR_JR_RESET_MASK;
    base->JOBRING[1].JRCR_JR = CAAM_JRCR_JR_RESET_MASK;
    base->DRR                = CAAM_DRR_RST0_MASK;
    base->MCFGR              = CAAM_MCFGR_SWRST_MASK;                           /* reset */
    base->MCFGR              = CAAM_MCFGR_SWRST_MASK | CAAM_MCFGR_DMA_RST_MASK; /* reset DMA */
    base->MCFGR              = 0x00082300u;                                     /* (reset value) */

    while (0U == (base->RTMCTL & CAAM_RTMCTL_TSTOP_OK_MASK))
    {
    }

